package annotation.lesson1;

public class AnnotationTheory {
    /* Java аннотации - специальный тип комментариев в вашем коде, с помощью которых можно:
    * 1) Передавать какие либо инструкции для Java компилятора
    * 2) Передавать какие-либо инструкцци для анализаторов исходного кода (пример: инструменты, которые генерируют
    * документацию из исходного кода)
    * 3) Передавать метаданные, которые могут быть использованы либо вашим Java приложением (с помощью рефлексии), либо
    * другими приложениями или фреймворками (например Spring Framework
    * Могут быть аннотированы класс, метод, параметр, поле и т.д.
    * В java есть встроенные аннотации, которые чаще всего используются @Override, @Deprecated, @SuppressWarnings */
}
